{
    "get_resource_planning": [
        "Give me the planning for resource X for this week",
        "Show me the schedule for resource Y for next month"
    ],
    "get_open_tasks": [
        "What are the open tasks for job JOB001?"
    ],
    "get_recommendations": [
        "Who is available this week for a 2h job nearby London who has the skill 'Carpentry'?"
    ],
    "list_resources": [
        "Show me all available resources in the system",
        "Find all resources with 'technician' in their name"
    ],
    "get_resource_details": [
        "What are the details for John Doe including their skills and capacity?",
        "Give me information about the resource named Sarah Smith for January 2024"
    ],
    "check_time_slot_availability": [
        "Is Conference Room A available on January 15th from 9 AM to 11 AM?",
        "Check if John Doe is free this Friday between 2 PM and 4 PM"
    ],
    "get_resource_availability": [
        "What's the availability for Dr. Smith during the week of January 8-12, 2024?",
        "Show me when the Main Conference Room is available next week"
    ],
    "create_appointment": [
        "Schedule a team meeting tomorrow from 10 AM to 11:30 AM with John Doe and Jane Smith",
        "Create an all-day training event for March 1st assigned to all technicians",
        "Book Conference Room B for a client presentation on Friday at 3 PM for 2 hours",
        "Schedule a high-priority installation appointment for TASK-001 with John Doe on January 20th from 9 AM to 12 PM in the Installation category",
        "Set up a repair appointment with travel time marker for Jane Smith next Monday 8 AM to 10 AM"
    ],
    "get_appointment_details": [
        "What are the details of the 'Team Meeting' scheduled for January 15th at 10 AM for resource Jack Sparrow?",
        "Show me information about John Doe's 'Client Consultation' appointment on January 18th",
        "Get the full details of the 'Project Review' meeting starting at 2024-01-20T14:00:00Z for resource Jack Daniels?"
    ],
    "update_appointment": [
        "Change the description of the 'Team Meeting' on January 15th at 10 AM to include the agenda",
        "Update the 'Client Consultation' on January 18th to be high priority (importance 5)",
        "Add Jane Smith as a resource to the 'Project Review' meeting on January 20th",
        "Change the category of the installation appointment on January 22nd to 'Maintenance'"
    ],
    "reschedule_appointment": [
        "Move the 'Team Meeting' from January 15th at 10 AM to January 16th at 2 PM",
        "Reschedule John Doe's 'Client Consultation' from Wednesday at 9 AM to Thursday at 3 PM (same duration)",
        "Change the 'Project Review' to a different time slot on the same day, from 2 PM to 4 PM instead",
        "Move the installation appointment to next week and assign it to a different technician"
    ],
    "delete_appointment": [
        "Cancel the 'Team Meeting' scheduled for January 15th at 10 AM",
        "Delete John Doe's appointment called 'Training Session' on January 18th",
        "Remove the 'Client Presentation' from the calendar on Friday at 3 PM"
    ],
    "complex_scenarios": [
        "Is John Doe available on January 25th from 1-3 PM? If yes, schedule a project kickoff meeting for him",
        "What's Sarah Smith's schedule for next week and when is she available for a 2-hour meeting?",
        "Find me a time slot when both John Doe and Jane Smith are available on Friday for a 90-minute meeting",
        "Show me all of Dr. Johnson's appointments for this month and reschedule the one on the 15th to the 22nd",
        "Check if the conference room is booked on January 30th at 10 AM, and if not, create a meeting there"
    ]
}